fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ЗаполнитьСписокДоговоров/Module.bsl
Функция ЗаполнитьСписокДоговоров(СписокДоговоров, Период) Экспорт
	
	ЕстьРеализации = ПроверитьРеализацииНаПериод(Период);
	
	Если ЕстьРеализации Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Реализации за данный период созданы" ;
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СписокДоговоров.Количество() > 0 Тогда
		
		СозданныхДокументов = 0;
		
		Для Каждого Договор Из СписокДоговоров Цикл
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = Период;
			НовыйДокумент.Договор = Договор;
			НовыйДокумент.Контрагент = Договор.Владелец;
			
			ЗаполнитьЗначенияСвойств(НовыйДокумент, Договор);
			
			НовыйДокумент.ВыполнитьАвтозаполнение(); 
			
			Если Не НовыйДокумент.ПроверитьЗаполнение() Тогда
				
				Возврат Ложь;
				
			КонецЕсли;
			
			НовыйДокумент.Записать();
			
			СозданныхДокументов = СозданныхДокументов + 1;
		
		КонецЦикла;
		
		КоличествоСозданныхДокументов = СтрШаблон("Количество созданных документов : %1", СозданныхДокументов);
		
		Возврат КоличествоСозданныхДокументов;				
		
	КонецЕсли;
		
КонецФункции

Функция ПроверитьРеализацииНаПериод(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &Период
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Период", Месяц(Период));	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//СписокРеализаций = Новый Массив;
	
	Если Выборка.Следующий Тогда
		
		Возврат Истина;
		
	Иначе
			
		Возврат Ложь;
					
	КонецЕсли;
		
КонецФункции
